app/views/friends/edit.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."follower_id" = ? AND "friends"."followed_id" = ? LIMIT ?  [["follower_id", 2], ["followed_id", 1], ["LIMIT", 1]]
---

<h2><%=User.find(flash[:ids]["followed_id"]).name%></h2><br>
<div style="width:200px;"> <image src="<%=(url_for(User.find(flash[:ids]["followed_id"]).avatar))%>" style="max-width:100%;" /> </div> <br>
<%flash[:user_ids] = {follower_id: current_user.id, followed_id: flash[:ids]["followed_id"]}%>
<%= button_to "Confirm Unfollow", {:controller => :friends, :action => 'destroy', :id => Friend.find_by(follower_id: current_user.id, followed_id: flash[:ids]["followed_id"]).id }, :method => :delete %>