app/views/friends/new.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---

<h2><%=User.find(flash[:ids]["followed_id"]).name%></h2><br>
<div style="width:200px;"> <image src="<%=(url_for(User.find(flash[:ids]["followed_id"]).avatar))%>" style="max-width:100%;" /> </div> <br>