app/views/post_comments/_form.html.erb

    <br><%= f.label :user_id %>
    <%= f.collection_select(:user_id, User.all, :id, :name) %></br>
    <br><%= f.label "Post" %>
    <%= f.collection_select(:post_id, Post.all, :id, :title) %></br>
---
SELECT "users".* FROM "users"
SELECT "posts".* FROM "posts"