app/views/users/show.html.erb

            <li>Bikes</br>
            <%@user.bikes.each do |b|%>
---
SELECT "bikes".* FROM "bikes" WHERE "bikes"."user_id" = ?  [["user_id", 2]]

    <% else %>
    <%= button_to "Unfollow User", edit_friend_path(Friend.find_by(follower_id: current_user.id, followed_id: @user.id)), method: :get %>
---
SELECT "friends".* FROM "friends" WHERE "friends"."follower_id" = ? AND "friends"."followed_id" = ? LIMIT ?  [["follower_id", 1], ["followed_id", 26], ["LIMIT", 1]]