app/views/trails/show.html.erb

    <br><%= link_to "Comment on this Trail!", new_trail_comment_path, data: { turbolinks: false } %></br>
    <br><%  @trail.trail_comments.each do |p| %>
---
SELECT "trails".* FROM "trails" WHERE (8) LIMIT ?  [["LIMIT", 1]]
SELECT "trail_comments".* FROM "trail_comments" WHERE "trail_comments"."trail_id" = ?  [["trail_id", 1]]