app/views/bikes/show.html.erb

SELECT "bike_comments".* FROM "bike_comments" WHERE "bike_comments"."bike_id" = ?  [["bike_id", 2]]
---
<br>
<ul><br><% @bike.bike_comments.each do |p| %>