app/views/posts/_form.html.erb

SELECT "users".* FROM "users"
SELECT "trails".* FROM "trails"
---
    <br><%= f.label :user_id %>
    <%= f.collection_select(:user_id, User.all, :id, :name) %></br>
    <br><%= f.label "Trail" %>
    <%= f.collection_select(:trail_id, Trail.all, :id, :name) %></br>