app/views/posts/show.html.erb

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 1]]
---
<ul>
<% @post.post_comments.each do |p| %>