app/controllers/auth_controller.rb

    def verify
      @user = User.find_by(username: login_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Juantoanxoup"], ["LIMIT", 1]]