app/controllers/auth_controller.rb

    def verify
      @user = User.find_by(name: login_params[:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Joh"], ["LIMIT", 1]]