app/controllers/bikes_controller.rb

SELECT "bikes".* FROM "bikes" WHERE "bikes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_bike
        @bike = Bike.find(params[:id])