app/controllers/comments_controller.rb

    def create

        @comment = Comment.new(comment_params)
        @comment.post_id = flash[:post_id]
        @comment.user_id = current_user.id

        if @comment.valid?
            @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["post_id", 1], ["description", "12334"], ["created_at", "2020-08-18 22:14:27.769923"], ["updated_at", "2020-08-18 22:14:27.769923"]]

    def find_comment
        @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]