app/controllers/friends_controller.rb

INSERT INTO "friends" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 3], ["followed_id", 1], ["created_at", "2020-08-19 16:59:33.076479"], ["updated_at", "2020-08-19 16:59:33.076479"]]
---
    def create
        @friend = Friend.new
        @friend.follower_id = flash[:user_ids]["follower_id"]
        @friend.followed_id = flash[:user_ids]["followed_id"]
        if @friend.valid?
            @friend.save

DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 33]]
---
    def destroy
        find_friend
        @friend.destroy

SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
---
    def find_friend
        @friend = Friend.find_by(id: params[:id])