app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 8]]
INSERT INTO "posts" ("user_id", "trail_id", "title", "description", "created_at", "updated_at", "meetup_date") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def following_posts
        @posts = []
        current_user.followeds.each do |followeds|
            followeds.posts.map do |post|
                @posts << post

INSERT INTO "posts" ("user_id", "trail_id", "title", "description", "created_at", "updated_at", "meetup_date") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        if @post.valid?
            @post.save

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Ab"], ["updated_at", "2020-08-18 14:49:45.711827"], ["id", 4]]
---
    def update
        find_post
        @post.update(post_params)