app/controllers/post_comments_controller.rb

    def create
        @post_comment = PostComment.new(comment_params)
        @post_comment.post_id = flash[:post_id]
        @post_comment.user_id = current_user.id
        if @post_comment.valid?
            @post_comment.save
---
INSERT INTO "post_comments" ("user_id", "post_id", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["post_id", 1], ["created_at", "2020-08-19 01:06:00.423704"], ["updated_at", "2020-08-19 01:06:00.423704"], ["description", "Brand New Test"]]

    def destroy
        find_post_comment
        post = @post_comment.post
        @post_comment.destroy
---
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 2]]

    def find_post_comment
        @post_comment = PostComment.find(params[:id])
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]