app/controllers/trails_controller.rb

SELECT "trails".* FROM "trails"
---
    def index
        @trails = Trail.all

INSERT INTO "trails" ("name", "location", "length", "duration", "difficulty", "trail_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["location", ""], ["length", ""], ["duration", ""], ["difficulty", ""], ["trail_type", ""], ["created_at", "2020-08-18 20:37:14.096657"], ["updated_at", "2020-08-18 20:37:14.096657"]]
---
    def create
        @trail = Trail.new(trail_params)
        if @trail.valid?
            @trail.save

SELECT "trails".* FROM "trails" WHERE "trails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_trail
        @trail = Trail.find(params[:id])