app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.valid?
            @rand = rand(15)
            @user.avatar.attach(io: File.open("app/assets/images/avatars/#{@rand}.jpg"),filename: "#{@rand}.jpg", content_type: 'image/jpg')
            @user.save
---
INSERT INTO "users" ("name", "age", "created_at", "updated_at", "password_digest", "username") VALUES (?, ?, ?, ?, ?, ?)  [["name", "New User 4"], ["age", 29], ["created_at", "2020-08-18 17:12:13.157938"], ["updated_at", "2020-08-18 17:12:13.157938"], ["password_digest", "admin"], ["username", "NewUser4"]]
INSERT INTO "users" ("name", "age", "created_at", "updated_at", "password_digest", "username") VALUES (?, ?, ?, ?, ?, ?)  [["name", "John Doan"], ["age", 30], ["created_at", "2020-08-18 18:30:30.003672"], ["updated_at", "2020-08-18 18:30:30.003672"], ["password_digest", "admin"], ["username", "NewUser5"]]

    def update
        find_user
        @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2020-08-17 21:25:39.691673"], ["id", 3]]