app/models/post.rb

    def post_date_after_current_date
        return if meetup_date.blank?
---
SELECT "posts".* FROM "posts"

    def self.upcoming_post
        self.select{|p| p.meetup_date > DateTime.now}
---
SELECT "posts".* FROM "posts"

    def self.past_post
        self.select{|p| p.meetup_date < DateTime.now}
---
SELECT "posts".* FROM "posts"